<template>
  <div class="questions">
    <!--popup's-->
    <div class="hint hint-questions">
      <div
        class="hint__close"
        @click="
          hideHint();
          showHints(2);
        "
      >
        <svg
          width="15"
          height="15"
          viewBox="0 0 15 15"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M14.822 13.9619L8.36002 7.49998L14.8219 1.03809C15.0594 0.800642 15.0594 0.415592 14.8219 0.178111C14.5844 -0.0593703 14.1994 -0.0593703 13.9619 0.178111L7.50004 6.63999L1.03809 0.178111C0.800642 -0.0593703 0.415592 -0.0593703 0.178111 0.178111C-0.0593703 0.415563 -0.0593703 0.800613 0.178111 1.03809L6.64002 7.49998L0.178111 13.9619C-0.0593703 14.1994 -0.0593703 14.5844 0.178111 14.8219C0.415563 15.0594 0.800612 15.0594 1.03809 14.8219L7.50004 8.35996L13.962 14.8219C14.1994 15.0594 14.5845 15.0594 14.822 14.8219C15.0594 14.5844 15.0594 14.1994 14.822 13.9619Z"
            fill="#0F1137"
          />
        </svg>
      </div>
      <div class="hint__icon">
        <svg
          width="80"
          height="80"
          viewBox="0 0 80 80"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M80 40C80 62.0917 62.0917 80 40 80C17.9083 80 0 62.0917 0 40C0 17.9083 17.9083 0 40 0C62.0917 0 80 17.9083 80 40Z"
            fill="#FFD15C"
          />
          <path
            d="M10.4047 54.5349C10.4047 55.4822 9.63683 56.25 8.68956 56.25C7.7423 56.25 6.97448 55.4822 6.97448 54.5349C6.97448 53.5876 7.7423 52.8198 8.68956 52.8198C9.63683 52.8198 10.4047 53.5876 10.4047 54.5349ZM51.9073 64.6161H50.8496C47.9913 64.6161 45.6286 66.781 45.3161 69.5575C45.2783 69.8914 45.5395 70.1849 45.8758 70.1849H48.1525C48.4167 70.1849 48.6505 70.0031 48.7042 69.7437C48.9087 68.7469 49.7931 67.9944 50.8496 67.9944H51.9073C53.1171 67.9944 54.0973 68.9752 54.0973 70.1849V70.2484C54.0973 71.0736 53.6377 71.8365 52.8973 72.2021C51.7615 72.7625 50.8075 73.6279 50.1404 74.704C49.4763 75.7751 49.1247 77.0081 49.1247 78.2684V78.9532C50.2753 78.6853 51.405 78.3655 52.5146 78.0005C52.6098 76.8146 53.3282 75.7654 54.4049 75.2252C55.3247 74.7632 56.0974 74.0576 56.64 73.1824C57.1869 72.3004 57.4756 71.286 57.4756 70.2484V70.1849C57.4756 67.1094 54.9829 64.6161 51.9073 64.6161ZM9.71984 36.4911H8.6621C5.80382 36.4911 3.44115 38.656 3.12865 41.4325C3.09081 41.7664 3.35204 42.0599 3.68834 42.0599H5.96495C6.22924 42.0599 6.463 41.8781 6.51671 41.6187C6.72118 40.6219 7.60558 39.8694 8.6621 39.8694H9.71984C10.9296 39.8694 11.9098 40.8502 11.9098 42.0599V42.1234C11.9098 42.9486 11.4502 43.7115 10.7098 44.0771C9.57396 44.6375 8.61998 45.5029 7.95287 46.579C7.28881 47.6501 6.93724 48.8831 6.93724 50.1434V50.9503C6.93724 51.261 7.18932 51.5131 7.5006 51.5131H9.7528C10.0635 51.5131 10.3162 51.261 10.3162 50.9503V50.1434C10.3162 48.8489 11.0602 47.6807 12.2174 47.1002C13.1372 46.6382 13.9099 45.9326 14.4525 45.0574C14.9994 44.1754 15.2881 43.161 15.2881 42.1234V42.0599C15.2881 38.9844 12.7954 36.4911 9.71984 36.4911Z"
            fill="#E8CE00"
          />
          <path
            d="M69.7796 55.5438C69.7796 56.4905 69.0118 57.2589 68.0646 57.2589C67.1173 57.2589 66.3495 56.4905 66.3495 55.5438C66.3495 54.5966 67.1173 53.8287 68.0646 53.8287C69.0118 53.8287 69.7796 54.5966 69.7796 55.5438ZM69.0948 37.5H68.0371C65.1788 37.5 62.8161 39.6649 62.5036 42.4408C62.4658 42.7753 62.727 43.0682 63.0633 43.0682H65.34C65.6042 43.0682 65.838 42.8864 65.8917 42.6276C66.0962 41.6309 66.9806 40.8783 68.0371 40.8783H69.0948C70.3045 40.8783 71.2848 41.8591 71.2848 43.0682V43.1317C71.2848 43.9569 70.8252 44.7205 70.0848 45.0854C68.949 45.6458 67.995 46.5112 67.3279 47.5879C66.6638 48.6591 66.3122 49.8914 66.3122 51.1517V51.9586C66.3122 52.2699 66.5643 52.522 66.8756 52.522H69.1278C69.4385 52.522 69.6911 52.2699 69.6911 51.9586V51.1517C69.6911 49.8578 70.4352 48.6896 71.5924 48.1091C72.5122 47.6471 73.2849 46.9415 73.8275 46.0663C74.3744 45.1843 74.6631 44.1693 74.6631 43.1317V43.0682C74.6631 39.9933 72.1704 37.5 69.0948 37.5Z"
            fill="#FFF5F5"
          />
          <path
            d="M29.687 15.4547V15.553C29.687 17.1649 29.2378 18.7415 28.3888 20.1117C27.5459 21.4709 26.3454 22.5677 24.9159 23.2849C23.119 24.187 21.9618 26.0016 21.9618 28.0127V29.2664C21.9618 29.7498 21.5706 30.141 21.0872 30.141H17.5886C17.1052 30.141 16.714 29.7498 16.714 29.2664V28.0127C16.714 26.0547 17.2591 24.14 18.2912 22.4756C19.3275 20.8038 20.8095 19.4586 22.574 18.5883C23.7239 18.0212 24.4386 16.8353 24.4386 15.553V15.4547C24.4386 13.5754 22.9152 12.0526 21.0365 12.0526H19.3928C17.751 12.0526 16.3771 13.2208 16.0597 14.7699C15.9773 15.1721 15.6129 15.4547 15.2028 15.4547H11.6664C11.1439 15.4547 10.7381 14.9994 10.7966 14.48C10.8967 13.5889 11.1348 12.735 11.4857 11.9464C13.2643 10.1392 15.2083 8.50464 17.3012 7.05994C17.9701 6.89331 18.6732 6.8042 19.3928 6.8042H21.0365C25.8137 6.80359 29.687 10.6769 29.687 15.4547ZM19.4356 32.171C17.964 32.171 16.7714 33.3643 16.7714 34.8358C16.7714 36.3074 17.964 37.5 19.4356 37.5C20.9071 37.5 22.1004 36.3068 22.1004 34.8352C22.1004 33.3636 20.9071 32.171 19.4356 32.171Z"
            fill="#6BAE01"
          />
          <path
            d="M69.6914 18.5773V18.7537C69.6914 21.6333 68.8894 24.4489 67.3721 26.8964C65.8657 29.325 63.7222 31.2842 61.1691 32.5647C57.9586 34.176 55.8926 37.4176 55.8926 41.0095V43.2489C55.8926 44.1119 55.1931 44.8114 54.3301 44.8114H48.0801C47.2171 44.8114 46.5176 44.1119 46.5176 43.2489V41.0095C46.5176 37.5116 47.4917 34.0918 49.335 31.1188C51.1868 28.1323 53.8327 25.73 56.9851 24.1754C59.0396 23.1622 60.3164 21.0443 60.3164 18.7537V18.5773C60.3164 15.2209 57.5955 12.5 54.2385 12.5H51.3027C48.3706 12.5 45.9164 14.5874 45.3488 17.3541C45.2017 18.0725 44.5516 18.5773 43.818 18.5773H37.5015C36.5676 18.5773 35.8431 17.7643 35.9475 16.8365C36.8154 9.13269 43.3706 3.125 51.3027 3.125H54.2385C62.7731 3.125 69.6914 10.0433 69.6914 18.5773Z"
            fill="#E31E7F"
          />
          <path
            d="M54.6439 3.13049C46.3102 3.34595 39.5963 10.1923 39.5963 18.5773H37.501C36.5671 18.5773 35.8426 17.7643 35.9476 16.8365C36.8149 9.13269 43.3701 3.125 51.3022 3.125H54.238C54.3741 3.125 54.509 3.12683 54.6439 3.13049ZM57.985 12.5H55.0486C54.9125 12.5 54.777 12.5061 54.6433 12.5146C57.8104 12.7234 60.3159 15.3571 60.3159 18.5773V18.7537C60.3159 21.0443 59.0391 23.1622 56.9846 24.1754C53.8322 25.73 51.1863 28.1323 49.3345 31.1188C47.4912 34.0918 46.5171 37.5116 46.5171 41.0095V43.2489C46.5171 44.1119 47.2165 44.8114 48.0796 44.8114H50.2634V41.0095C50.2634 37.5116 51.2455 34.1998 53.1248 31.25C55.9373 26.8359 63.7498 26.8359 64.0623 18.7537V18.5773C64.0623 15.2209 61.3413 12.5 57.985 12.5ZM51.3791 48.4375C48.751 48.4375 46.6196 50.5682 46.6196 53.197C46.6196 55.8252 48.751 57.9565 51.3791 57.9565C54.0079 57.9565 56.1387 55.8252 56.1387 53.197C56.1387 50.5682 54.0079 48.4375 51.3791 48.4375Z"
            fill="#C2186C"
          />
          <path
            d="M56.1394 53.197C56.1394 55.1221 54.9962 56.7792 53.3519 57.5287C51.7076 56.7792 50.5645 55.1221 50.5645 53.197C50.5645 51.272 51.7076 49.6149 53.3519 48.8654C54.9962 49.6149 56.1394 51.272 56.1394 53.197Z"
            fill="#E31E7F"
          />
          <path
            d="M43.0122 50.0153V50.1489C43.0122 52.3419 42.4013 54.4861 41.2459 56.3495C40.0996 58.1989 38.4669 59.6899 36.523 60.6659C34.0779 61.8927 32.505 64.361 32.505 67.0959V68.8013C32.505 69.458 31.9722 69.9908 31.3155 69.9908H26.5559C25.8992 69.9908 25.3664 69.4586 25.3664 68.8013V67.0959C25.3664 64.4324 26.1079 61.8286 27.5117 59.5648C28.9217 57.2906 30.9364 55.4614 33.3369 54.2773C34.9013 53.5059 35.8736 51.8933 35.8736 50.1489V50.0153C35.8736 47.4591 33.8014 45.3876 31.2459 45.3876H29.0102C26.7775 45.3876 24.9092 46.9769 24.4765 49.0839C24.3648 49.6307 23.8698 50.0153 23.3113 50.0153H18.5011C17.7901 50.0153 17.2383 49.3958 17.3183 48.6896C17.9787 42.8229 22.9701 38.2489 29.0102 38.2489H31.2459C37.7443 38.2489 43.0122 43.5168 43.0122 50.0153Z"
            fill="#0995A3"
          />
          <path
            d="M32.693 76.3757C32.693 78.3777 31.0701 80 29.0687 80C27.0674 80 25.4451 78.3777 25.4451 76.3757C25.4451 74.3744 27.0674 72.7521 29.0687 72.7521C31.0707 72.7521 32.693 74.3744 32.693 76.3757ZM31.2459 38.2489H29.0102C22.9701 38.2489 17.9787 42.8229 17.3183 48.6896C17.2383 49.3958 17.7901 50.0153 18.5011 50.0153H20.0966C20.0966 43.6304 25.2089 38.4167 31.5547 38.2526C31.4522 38.2501 31.349 38.2489 31.2459 38.2489ZM34.0987 45.3876H31.8629C31.7592 45.3876 31.6566 45.3918 31.5541 45.3986C33.9662 45.5573 35.8736 47.5629 35.8736 50.0153V50.1489C35.8736 51.8933 34.9013 53.5059 33.3369 54.2773C30.9364 55.4614 28.9217 57.29 27.5117 59.5648C26.1085 61.828 25.3664 64.4324 25.3664 67.0959V68.8013C25.3664 69.4586 25.8992 69.9908 26.5565 69.9908H28.2191V67.0959C28.2191 64.433 28.9668 61.911 30.3981 59.6649C32.5398 56.3037 38.4883 56.3037 38.7263 50.1495V50.0153C38.7263 47.4591 36.6542 45.3876 34.0987 45.3876Z"
            fill="#00808A"
          />
          <path
            d="M32.6929 76.3757C32.6929 77.8418 31.8219 79.1034 30.5701 79.6741C29.3182 79.1034 28.4473 77.8418 28.4473 76.3757C28.4473 74.9103 29.3182 73.6487 30.5701 73.0774C31.8219 73.6487 32.6929 74.9103 32.6929 76.3757Z"
            fill="#0995A3"
          />
        </svg>
      </div>
      <h4 class="hint__title">Ответь на вопрос - не упусти клиента</h4>
      <p class="hint__subtitle">
        Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать
        несколько
      </p>
      <a class="show-questions" href="cabinet/questions">
        <span>Смотреть вопросы</span>
      </a>
    </div>
    <div class="hint hint-certificate">
      <div class="hint__close" @click="hideHint()">
        <svg
          width="15"
          height="15"
          viewBox="0 0 15 15"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M14.822 13.9619L8.36002 7.49998L14.8219 1.03809C15.0594 0.800642 15.0594 0.415592 14.8219 0.178111C14.5844 -0.0593703 14.1994 -0.0593703 13.9619 0.178111L7.50004 6.63999L1.03809 0.178111C0.800642 -0.0593703 0.415592 -0.0593703 0.178111 0.178111C-0.0593703 0.415563 -0.0593703 0.800613 0.178111 1.03809L6.64002 7.49998L0.178111 13.9619C-0.0593703 14.1994 -0.0593703 14.5844 0.178111 14.8219C0.415563 15.0594 0.800612 15.0594 1.03809 14.8219L7.50004 8.35996L13.962 14.8219C14.1994 15.0594 14.5845 15.0594 14.822 14.8219C15.0594 14.5844 15.0594 14.1994 14.822 13.9619Z"
            fill="#0F1137"
          />
        </svg>
      </div>
      <div class="hint__icon">
        <svg
          width="80"
          height="80"
          viewBox="0 0 80 80"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M80 40C80 44.3265 79.3126 48.4947 78.0408 52.3967C76.3053 57.7306 73.4775 62.5714 69.8237 66.6563C68.3869 68.2645 66.8212 69.7535 65.1429 71.1102C64.6939 71.4759 64.2351 71.8302 63.7698 72.1747C57.1249 77.0922 48.9012 80 40 80C28.1486 80 17.5004 74.8457 10.1763 66.6563C6.52245 62.5714 3.69469 57.7306 1.95918 52.3967C0.687347 48.4947 0 44.3265 0 40C0 35.6735 0.687347 31.5053 1.95918 27.6033C4.55184 19.6392 9.57551 12.7739 16.1551 7.88082C22.8147 2.92898 31.0645 0 40 0C48.9355 0 57.1853 2.92898 63.8449 7.88082C70.4245 12.7739 75.4482 19.6392 78.0408 27.6033C79.3126 31.5053 80 35.6735 80 40Z"
            fill="#FFD15C"
          />
          <path
            d="M78.0406 7.88058V52.3965C76.3051 57.7304 73.4773 62.5712 69.8235 66.6561H10.1761C6.52225 62.5712 3.69449 57.7304 1.95898 52.3965V7.88058H78.0406Z"
            fill="#33B5E5"
          />
          <path
            d="M71.5106 51.6357V22.901C66.8218 22.901 63.0208 19.1 63.0208 14.4112H16.98C16.98 19.1 13.1791 22.901 8.49023 22.901V51.6357C13.1791 51.6357 16.98 55.4367 16.98 60.1255H63.0208C63.0208 55.4367 66.8218 51.6357 71.5106 51.6357Z"
            fill="#F7F7FA"
          />
          <path
            d="M25.1426 25.5981H54.8579V29.0265H25.1426V25.5981Z"
            fill="#0F1137"
          />
          <path
            d="M17.1289 33.0239H62.8721V36.4523H17.1289V33.0239Z"
            fill="#0F1137"
          />
          <path
            d="M17.1289 40.4502H62.8721V43.8786H17.1289V40.4502Z"
            fill="#0F1137"
          />
          <path
            d="M65.1431 60.7786V71.11C64.6941 71.4757 64.2353 71.83 63.77 72.1745L59.592 70.0847L54.041 72.8602V60.7786H65.1431Z"
            fill="#F6E06E"
          />
          <path
            d="M68.4159 56.9751C68.4159 55.6783 69.5815 54.1583 69.1139 53.0306C68.6291 51.8616 66.7124 51.6162 65.8314 50.7354C64.9505 49.8544 64.7052 47.9377 63.5363 47.453C62.4086 46.9854 60.8886 48.1509 59.5918 48.1509C58.2949 48.1509 56.7749 46.9854 55.6473 47.453C54.4783 47.9377 54.2329 49.8544 53.3521 50.7354C52.4711 51.6164 50.5544 51.8616 50.0696 53.0306C49.6021 54.1583 50.7676 55.6783 50.7676 56.9751C50.7676 58.2719 49.6021 59.7919 50.0696 60.9196C50.5544 62.0886 52.4711 62.3339 53.3521 63.2148C54.2331 64.0957 54.4783 66.0125 55.6473 66.4972C56.7749 66.9648 58.2949 65.7993 59.5918 65.7993C60.8886 65.7993 62.4086 66.9648 63.5363 66.4972C64.7052 66.0125 64.9506 64.0957 65.8314 63.2148C66.7124 62.3338 68.6291 62.0886 69.1139 60.9196C69.5813 59.7919 68.4159 58.2719 68.4159 56.9751Z"
            fill="#EB4747"
          />
          <path
            d="M59.5924 62.4818C62.6335 62.4818 65.0988 60.0165 65.0988 56.9754C65.0988 53.9342 62.6335 51.4689 59.5924 51.4689C56.5513 51.4689 54.0859 53.9342 54.0859 56.9754C54.0859 60.0165 56.5513 62.4818 59.5924 62.4818Z"
            fill="#CD3333"
          />
        </svg>
      </div>
      <h4 class="hint__title">Получи сертификат</h4>
      <p class="hint__subtitle">
        Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать
        несколько
      </p>
      <a class="show-certificate" href="#">
        <span>Получить сертификат </span>
      </a>
    </div>
  </div>
</template>
<script>
import {} from "../api/question";
import QuestionCard from "../components/questions/QuestionCard.vue";
export default {
  el: "#questions-vue",
  components: {
    QuestionCard,
  },
  data: () => {
    return {
      // Самые обсуждаемые вопросы
      question: {
        id: 1,
        text: "Здравствуйте, я пенсионер имею ли я право ездит в пригородных электричках бесплатно? (больше никаких льгот нет)",
        tags: ["#Пенсия"],
      },
      // Остальные вопросы
      questions: [
        {
          id: 1,
          text: "Здравствуйте, я пенсионер имею ли я право ездит в пригородных электричках бесплатно? (больше никаких льгот нет)",
          tags: ["#Пенсия"],
        },
        {
          id: 2,
          text: "Добрый вечер, я являюсь ветераном труда и пенсионером, не являюсь собственником жилья, просто прописана в квартире мужа (он собственник, не пенсионер). Отказывают в реализации льготы на содержание жилья, ссылаясь на жилищный кодекс, остальные льготы на коммунальные услуги учитывают.",
          tags: ["#ЖКХ", "#ТСЖ", "#Пенсия"],
        },
        {
          id: 3,
          text: "Добрый день, скажите, Кому уплачивается штраф, если груз доставлен автомобильным транспортом не в срок?",
          tags: ["#Грузоперевозки и экспедиция"],
        },
        {
          id: 4,
          text: "Здравствуйте, я пенсионер имею ли я право ездит в пригородных электричках бесплатно? (больше никаких льгот нет)",
          tags: ["#Пенсия"],
        },
        {
          id: 5,
          text: "Здравствуйте, я пенсионер имею ли я право ездит в пригородных электричках бесплатно? (больше никаких льгот нет)",
          tags: ["#Пенсия"],
        },
        {
          id: 6,
          text: "Добрый вечер, я являюсь ветераном труда и пенсионером, не являюсь собственником жилья, просто прописана в квартире мужа (он собственник, не пенсионер). Отказывают в реализации льготы на содержание жилья, ссылаясь на жилищный кодекс, остальные льготы на коммунальные услуги учитывают.",
          tags: ["#ЖКХ", "#ТСЖ", "#Пенсия"],
        },
        {
          id: 7,
          text: "Здравствуйте, я пенсионер имею ли я право ездит в пригородных электричках бесплатно? (больше никаких льгот нет)",
          tags: ["#Пенсия"],
        },
      ],
      questionsMatter: [
        {
          id: 1,
          text: "Здравствуйте, я пенсионер имею ли я право ездит в пригородных электричках бесплатно? (больше никаких льгот нет)",
          tags: ["#Пенсия"],
        },
        {
          id: 2,
          text: "Добрый вечер, я являюсь ветераном труда и пенсионером, не являюсь собственником жилья, просто прописана в квартире мужа (он собственник, не пенсионер). Отказывают в реализации льготы на содержание жилья, ссылаясь на жилищный кодекс, остальные льготы на коммунальные услуги учитывают.",
          tags: ["#ЖКХ", "#ТСЖ", "#Пенсия"],
        },
        {
          id: 3,
          text: "Добрый день, скажите, Кому уплачивается штраф, если груз доставлен автомобильным транспортом не в срок?",
          tags: ["#Грузоперевозки и экспедиция"],
        },
      ],
      questionsMyAnswers: [],
    };
  },
  methods: {
    hideHint() {
      const hideHint = document.querySelector(".openHint");
      hideHint.classList.remove("openHint");
    },
    showHints(hint) {
      switch (hint) {
        case 1: {
          setTimeout(() => {
            document.querySelector(".hint-questions").classList.add("openHint");
          }, 10000);
          break;
        }
        case 2: {
          setTimeout(() => {
            document
              .querySelector(".hint-certificate")
              .classList.add("openHint");
          }, 10000);
          break;
        }
        default: {
          console.log("incorrect input");
          break;
        }
      }
    },
  },
  mounted() {
    //opening of the 1st popup window automatically
    this.showHints(1);
  },
};
</script>
<style lang="scss" scoped>
.questions {
  .replied {
    box-shadow: 0 0 1rem rgba(0, 0, 0, 0.07);
    border-radius: 0.5rem;
    border-left: 0.5rem solid var(--ct-green);
    background-color: var(--ct-white);
    padding: 1.5rem 3rem 2rem 2rem;
    margin-bottom: 2rem;
    &__header {
      display: flex;
      flex-flow: row nowrap;
      justify-content: space-between;
      align-items: center;
      margin-bottom: 2rem;
    }

    &__title {
      display: flex;
      align-items: center;
      svg {
        width: 1.8rem;
        height: 1.8rem;
        fill: var(--ct-green);
      }

      span {
        font-weight: 600;
        font-size: var(--text-22);
        line-height: 2.6rem;
        color: var(--ct-green);
        margin-left: 1rem;
      }
    }

    &__count {
      font-weight: 400;
      font-size: var(--text-16);
      line-height: 1.9rem;
      color: var(--ct-dark-gray);
    }
    .question {
      margin-left: 4rem;
      border: none;
    }
  }

  &__list {
    background-color: var(--ct-white);
    padding: 3rem;
    border-radius: 0.5rem;
    &-empty {
      text-align: center;
      font-size: 1.4rem;
    }
  }

  .hint {
    display: none;
    position: fixed;
    bottom: 2rem;
    right: 2rem;
    max-width: 44rem;
    max-height: 35rem;
    padding: 4rem;
    text-align: center;
    background-color: var(--ct-white);
    box-shadow: 0px 0px 12px -6px rgb(0 0 0 / 75%);
    z-index: 2;
    &__close {
      cursor: pointer;
      position: absolute;
      top: 1rem;
      right: 1rem;
      svg {
        width: 1.5rem;
        height: 1.5rem;
      }
    }
    &__icon {
      margin-bottom: 1rem;
    }
    &__title {
      margin: auto;
      max-width: 80%;
      font-size: 2.2rem;
      font-weight: 700;
      color: var(--ct-blue);
      margin-bottom: 1.5rem;
    }
    &__subtitle {
      font-size: 1.4rem;
      font-weight: 400;
      line-height: normal;
      margin-bottom: 3rem;
    }
  }
  .record {
    margin: 0 auto;
    margin-bottom: 1.5rem;
    width: 60%;
    display: flex;
    color: var(--ct-white);
    background-color: var(--ct-red);
    padding: 1.3rem 2rem;
    border-radius: 0.5rem;

    &__title {
      margin-left: 0.9rem;
      font-weight: 800;
      font-size: var(--text-18);
      line-height: 2.2rem;
    }

    &__icon {
      svg {
        width: 1.8rem;
        height: 2rem;
        fill: var(--ct-white);
      }
    }
  }
  .show {
    &-questions,
    &-certificate {
      display: inline-block;
      padding: 1.2rem 3rem;
      background-color: var(--ct-blue);
      border-radius: 0.5rem;
      margin-bottom: 1.5rem;
      span {
        color: var(--ct-white);
        font-size: 1.8rem;
        font-weight: 800;
      }
    }
  }
  .openHint {
    display: block;
  }
}
</style>
